Q1. List any five functions of the pandas library with execution.

head()-This function is used to get the first 5 rows
tail()-This function gives the last 5 rows.
read_csv-Used to read any csv file.
dtypes()-Used to get the type of data in table.
Categorial-Used to get the categorised data.

In [1]:
import pandas as pd

In [2]:

d=pd.read_csv("Services.csv")

In [3]:
d.head()

              Name  Age       Location         Occupation
0         John Doe   25       New York  Software Engineer
1       Jane Smith   32    Los Angeles  Marketing Manager
2  Michael Johnson   45        Chicago            Teacher
3   Emily Williams   28  San Francisco   Graphic Designer

In [4]:
d.tail()

              Name  Age       Location         Occupation
0         John Doe   25       New York  Software Engineer
1       Jane Smith   32    Los Angeles  Marketing Manager
2  Michael Johnson   45        Chicago            Teacher
3   Emily Williams   28  San Francisco   Graphic Designer

In [5]:
d.dtypes

Name          object
Age            int64
Location      object
Occupation    object
dtype: object

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
d.index=d.index +2

In [8]:
d

              Name  Age       Location         Occupation
2         John Doe   25       New York  Software Engineer
3       Jane Smith   32    Los Angeles  Marketing Manager
4  Michael Johnson   45        Chicago            Teacher
5   Emily Williams   28  San Francisco   Graphic Designer

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [9]:
d=pd.read_csv("Assignment.csv")

In [10]:
d

   Values
0      10
1      20
2      30
3      40
4      50

In [11]:
sum_first_3 = d['Values'].iloc[:3].sum()

In [12]:
sum_first_3

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [13]:
d['Text']=0

In [14]:
d['Word_Count']=d['Text']

In [15]:
d

   Values  Text  Word_Count
0      10     0           0
1      20     0           0
2      30     0           0
3      40     0           0
4      50     0           0

Q5. How are DataFrame.size() and DataFrame.shape() different?

Dataframe.size()-It gives the size of the  dataframe.
The size attribute of a DataFrame returns the total number of elements in the DataFrame.
It gives you the count of all the cells (rows * columns) in the DataFrame.
This value includes both data cells and any potential missing or NaN (Not a Number) values.


Dataframe.shape()-It gives the type of the data .The shape attribute of a DataFrame returns a tuple representing the dimensions of the DataFrame.
It provides the number of rows followed by the number of columns in the DataFrame.
It does not count individual elements but gives you a sense of the DataFrame's structure.

Q6. Which function of pandas do we use to read an excel file?

pandas.read excel() is pandas read_excel function which is used to read the excel sheets with extensions

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [16]:
d['Email']='username@domain.com'

In [17]:
d['Username']=d['Email']

In [18]:
d

   Values  Text  Word_Count                Email             Username
0      10     0           0  username@domain.com  username@domain.com
1      20     0           0  username@domain.com  username@domain.com
2      30     0           0  username@domain.com  username@domain.com
3      40     0           0  username@domain.com  username@domain.com
4      50     0           0  username@domain.com  username@domain.com

In [19]:
d['Email']=d['Email'][1:8]

In [20]:
d['User']=d['Username'].str.split('@').str.get(0)

In [21]:
d

,Values,Text,Word_Count,Email,Username,User
0,10,0,0,NaN,username@domain.com,username
1,20,0,0,username@domain.com,username@domain.com,username
2,30,0,0,username@domain.com,username@domain.com,username
3,40,0,0,username@domain.com,username@domain.com,username
4,50,0,0,username@domain.com,username@domain.com,username

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [22]:
import pandas as pd


data = {'A': [3, 8, 6, 2, 9],
        'B': [5, 2, 9, 3, 1],
        'C': [1, 7, 4, 5, 2]}
df = pd.DataFrame(data)


def select_rows(df):
    selected_rows = df[(df['A'] > 5) & (df['B'] < 10)]
    return selected_rows

selected_df = select_rows(df)

print("Selected rows:")
print(selected_df)

Selected rows:
   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [23]:
import math 
data = { 2,3,4,5,6,6}  
df["Values"] = pd.DataFrame(data)

In [24]:
df.drop(0)
df

   A  B  C  Values
0  3  5  1       2
1  8  2  7       3
2  6  9  4       4
3  2  3  5       5
4  9  1  2       6

In [25]:
mean=df.mean()

In [26]:
mean

A         5.6
B         4.0
C         3.8
Values    4.0
dtype: float64

In [27]:
median=df.median()

In [28]:
median

A         6.0
B         3.0
C         4.0
Values    4.0
dtype: float64

In [29]:
Standard_deviation=df.std()

In [30]:
Standard_deviation

A         3.049590
B         3.162278
C         2.387467
Values    1.581139
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [31]:
import pandas as pd

def calculate_moving_average(df):
   
    df = df.sort_values(by='Date')
    
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

data = {'Date': pd.date_range('2023-08-01', periods=20),
        'Sales': [10, 15, 8, 20, 25, 18, 12, 17, 22, 28, 30, 24, 16, 19, 21, 26, 14, 23, 27, 32]}

df = pd.DataFrame(data)
result_df = calculate_moving_average(df)

print(result_df)

         Date  Sales  MovingAverage
0  2023-08-01     10      10.000000
1  2023-08-02     15      12.500000
2  2023-08-03      8      11.000000
3  2023-08-04     20      13.250000
4  2023-08-05     25      15.600000
5  2023-08-06     18      16.000000
6  2023-08-07     12      15.428571
7  2023-08-08     17      16.428571
8  2023-08-09     22      17.428571
9  2023-08-10     28      20.285714
10 2023-08-11     30      21.714286
11 2023-08-12     24      21.571429
12 2023-08-13     16      21.285714
13 2023-08-14     19      22.285714
14 2023-08-15     21      22.857143
15 2023-08-16     26      23.428571
16 2023-08-17     14      21.428571
17 2023-08-18     23      20.428571
18 2023-08-19     27      20.857143
19 2023-08-20     32      23.142857

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [32]:
import pandas as pd

def add_weekday_column(df):
   
    df['Date'] = pd.to_datetime(df['Date'])
    
  
    df['Weekday'] = df['Date'].dt.strftime('%A')
    
    return df

data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)

result_df = add_weekday_column(df)
print(result_df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [ ]:
import pandas as pd

def filter_date_range(df):
    # Convert 'Date' column to datetime if it's not already in datetime format
    df['Date'] = pd.to_datetime(df['Date'])

    # Define the date range
    start_date = pd.to_datetime('2023-01-01')
    end_date = pd.to_datetime('2023-01-31')

    # Use boolean indexing to select rows within the date range
    filtered_df = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]

    return filtered_df

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
To use the basic functions of pandas we requires pandas library itself.
Firstly we needt to import the pandas as pd

You can take the pandas as pd or anything else
After this you ak